#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aws-lambda-cost.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_lambda"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.aws-lambda-cost.aws_lambda_function.aws-lambda-cost will be updated in-place
  ~ resource "aws_lambda_function" "aws-lambda-cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/app.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "exports.handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
        last_modified                  = "2019-11-16T14:29:11.821+0000"
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = 0
      ~ role                           = "arn:aws:iam::589845989135:role/iam_for_lambda" -> (known after apply)
        runtime                        = "nodejs10.x"
        source_code_hash               = "G55Ziq1Bg6j/VC+nqViddon+tQUImHcRwzNeHvL03Q8="
        source_code_size               = 1651
        tags                           = {}
        timeout                        = 60
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "#aws"
                "SLACK_WEBHOOK_URL"  = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
